ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
/******************************************************************************
 * Función: SubProceso_ResetSistema
 * ---------------------------------------------------------------------------
 * Reinicia el sistema mostrando el avance del proceso en la pantalla LCD.
 *
 * Proceso:
 *      1. Mostrar mensaje de reinicio.
 *      2. Apagar buzzer.
 *      3. Apagar LEDs.
 *      4. Limpiar variables.
 *      5. Finalizar el reinicio.
 ******************************************************************************/
void SubProceso_ResetSistema(void)
{
    /*==============================================================
        Pantalla de inicio
    ==============================================================*/
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1, 4);
    LCD_I2C_WriteString("Reiniciando");

    LCD_I2C_SetCursor(2, 6);
    LCD_I2C_WriteString("Sistema");
    __delay_ms(1000);

    /*==============================================================
        Paso 1: Apagar buzzer
    ==============================================================*/
    LCD_I2C_SetCursor(3, 4);
    LCD_I2C_WriteString("Apagando Buzzer");

    Buzzer_Off(&buzzer1);

    MostrarAnimacionCarga(4, 2);

    LCD_I2C_SetCursor(3, 0);
    LCD_I2C_ClearFile();


    /*==============================================================
        Paso 2: Apagar LEDs
    ==============================================================*/
    LCD_I2C_SetCursor(3, 4);
    LCD_I2C_WriteString("Apagando LEDs");

    WS2812B_Clear(&tira1);

    MostrarAnimacionCarga(4, 6);

    LCD_I2C_SetCursor(3, 0);
    LCD_I2C_ClearFile();


    /*==============================================================
        Paso 3: Limpiar variables
    ==============================================================*/
    LCD_I2C_SetCursor(3, 1);
    LCD_I2C_WriteString("Limpiando Variables");

    /**************************************************************
     * Reiniciar aquí todas las variables del sistema
     **************************************************************/
    // contador = 0;
    // estado = 0;
    // alarma = false;
    // etc...

    MostrarAnimacionCarga(4, 10);

    LCD_I2C_SetCursor(3, 0);
    LCD_I2C_ClearFile();


    /*==============================================================
        Paso 4: Finalizar reinicio
    ==============================================================*/
    LCD_I2C_SetCursor(3, 5);
    LCD_I2C_WriteString("Reseteando");

    MostrarAnimacionCarga(4, 14);

    /*==============================================================
        Reinicio final
    ==============================================================*/
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(2, 5);
    LCD_I2C_WriteString("Sistema");

    LCD_I2C_SetCursor(3, 4);
    LCD_I2C_WriteString("Reiniciado");

    __delay_ms(1000);
    LCD_I2C_Clear();
}

/******************************************************************************
 * Función: SubProceso_MenuLCD
 *----------------------------------------------------------------------------
 * Muestra el menú principal del sistema y espera a que el usuario seleccione
 * una opción mediante el teclado matricial.
 *
 * Opciones disponibles:
 *   1 -> Agregar horario
 *   2 -> Modificar horario
 *   3 -> Ver horarios
 *   4 -> Registrar pastillas
 *   * -> Resetear sistema
 *
 * Si se ingresa una opción inválida, el menú vuelve a mostrarse.
 ******************************************************************************/
void SubProceso_MenuLCD(void)
{
    /* Inicializar la tecla como "sin pulsar" */
    tecla = KEYPAD_NO_KEY;

    /* Mantener el menú activo hasta recibir una opción válida */
    while (tecla == KEYPAD_NO_KEY)
    {
        /*==============================================================
         * Pantalla de bienvenida
         *==============================================================*/
        LCD_I2C_Clear();

        LCD_I2C_SetCursor(1, 5);
        LCD_I2C_WriteString("Seleccionar");

        LCD_I2C_SetCursor(2, 3);
        LCD_I2C_WriteString("Opcion Deseada");

        __delay_ms(2000);


        /*==============================================================
         * Mostrar menú principal
         *==============================================================*/
        LCD_I2C_Clear();

        LCD_I2C_SetCursor(1, 0);
        LCD_I2C_WriteString("1.Agr.Hor  2.Mod.Hor");

        LCD_I2C_SetCursor(2, 0);
        LCD_I2C_WriteString("3.Ver horarios");

        LCD_I2C_SetCursor(3, 0);
        LCD_I2C_WriteString("4.Reg. pastillas");

        LCD_I2C_SetCursor(4, 0);
        LCD_I2C_WriteString("*.Reset sistema");


        /*==============================================================
         * Esperar la pulsación de una tecla
         * Tiempo máximo aproximado: 5 segundos
         * (500 iteraciones × 10 ms)
         *==============================================================*/
        for (unsigned int index = 0; index < 500; index++)
        {
            tecla = Keypad_Read(&teclado);

            if (tecla != KEYPAD_NO_KEY)
            {
                LCD_I2C_Clear();

                /*======================================================
                 * Procesar la opción seleccionada
                 *======================================================*/
                switch (tecla)
                {
                    case '1':
                        Buzzer_CorrectSound(&buzzer1);
                        LCD_I2C_SetCursor(1, 7);
                        LCD_I2C_WriteString("Opcion");
                        LCD_I2C_SetCursor(2, 2);
                        LCD_I2C_WriteString("Agregar Horario");
                        __delay_ms(2000);
                        SubProceso_AgregarHorario();
                        break;

                    case '2':
                        Buzzer_CorrectSound(&buzzer1);
                        LCD_I2C_SetCursor(1, 7);
                        LCD_I2C_WriteString("Opcion");
                        LCD_I2C_SetCursor(2, 1);
                        LCD_I2C_WriteString("Modificar Horario");
                        __delay_ms(2000);
                        SubProceso_ModificarHorario();
                        break;

