ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
                    case '3':
                        Buzzer_CorrectSound(&buzzer1);
                        LCD_I2C_SetCursor(1, 7);
                        LCD_I2C_WriteString("Opcion");
                        LCD_I2C_SetCursor(2, 4);
                        LCD_I2C_WriteString("Ver Horarios");
                        __delay_ms(2000);
                        SubProceso_VerHorarios();
                        break;

                    case '4':
                        Buzzer_CorrectSound(&buzzer1);
                        LCD_I2C_SetCursor(1, 7);
                        LCD_I2C_WriteString("Opcion");
                        LCD_I2C_SetCursor(2, 1);
                        LCD_I2C_WriteString("Registrar Pastilla");
                        __delay_ms(2000);
                        SubProceso_RegistrarPastillas();
                        break;

                    case '*':
                        Buzzer_CorrectSound(&buzzer1);
                        LCD_I2C_SetCursor(1, 7);
                        LCD_I2C_WriteString("Opcion");
                        LCD_I2C_SetCursor(2, 3);
                        LCD_I2C_WriteString("Reset sistema");
                        __delay_ms(2000);
                        SubProceso_ResetSistema();
                        break;

                    default:
                        /* Opción inválida: informar al usuario y
                           volver a mostrar el menú. */
                        Buzzer_ErrorSound(&buzzer1);
                        LCD_I2C_SetCursor(2, 2);
                        LCD_I2C_WriteString("Opcion Invalida");
                        __delay_ms(500);

                        tecla = KEYPAD_NO_KEY;
                        break;
                }
            }

            /* Retardo para evitar lecturas excesivamente rápidas */
            __delay_ms(10);
        }
    }
}
/******************************************************************************
 * Función: SubProceso_VerHorarios
 *----------------------------------------------------------------------------
 * Permite visualizar los horarios almacenados en la memoria EEPROM.
 *
 * Flujo:
 *   1. Lee la cantidad de horarios registrados.
 *   2. Verifica que los datos almacenados sean válidos.
 *   3. Prepara la información para su visualización.
 *   4. Muestra los horarios en páginas de hasta 3 registros.
 *   5. Permite navegar entre páginas mediante el teclado.
 *
 * Controles:
 *   A -> Página anterior.
 *   B -> Página siguiente.
 *   * -> Salir.
 ******************************************************************************/
void SubProceso_VerHorarios(void)
{
    /*==============================================================
     * Leer cantidad de horarios registrados
     *==============================================================*/
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,6);
    LCD_I2C_WriteString("Horarios");

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Leyendo Memoria");

    dato_memoria = EEPROM_ReadByte(1);

    MostrarAnimacionCarga(4,0);

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,2);
    LCD_I2C_WriteString("Extrayendo Datos");

    MostrarAnimacionCarga(4,4);

    /*==============================================================
     * Validar información almacenada
     *==============================================================*/
    if (dato_memoria == 0xFF || dato_memoria > 6)
    {
        MostrarAnimacionCarga(4,8);

        LCD_I2C_SetCursor(3,0);
        LCD_I2C_ClearFile();

        LCD_I2C_SetCursor(3,2);
        LCD_I2C_WriteString("Datos Corruptos");

        __delay_ms(1500);
        return;
    }

    if (dato_memoria == 0)
    {
        MostrarAnimacionCarga(4,8);

        LCD_I2C_SetCursor(3,0);
        LCD_I2C_ClearFile();

        LCD_I2C_SetCursor(3,0);
        LCD_I2C_WriteString("Sin Hor. Registrados");

        __delay_ms(1500);
        return;
    }

    /*==============================================================
     * Preparar información para mostrarla en pantalla
     *==============================================================*/
    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,2);
    LCD_I2C_WriteString("Preparando Datos");

    MostrarAnimacionCarga(4,8);
    MostrarAnimacionCarga(4,12);

    /*==============================================================
     * Variables de navegación
     *==============================================================*/
    uint8_t cant_horarios = dato_memoria;
    uint8_t pagina = 0;
    uint8_t paginas_max = (cant_horarios - 1) / 3;

    /*==============================================================
     * Navegación entre páginas
     *==============================================================*/
    while (1)
    {
        /*----------------------------------------------------------
         * Mostrar encabezado
         *----------------------------------------------------------*/
        LCD_I2C_Clear();

        LCD_I2C_SetCursor(1,0);
        LCD_I2C_WriteString("--- MIS HORARIOS ---");

        /*----------------------------------------------------------
         * Mostrar horarios de la página actual
         *----------------------------------------------------------*/
        uint8_t horarios_por_pagina;
        switch (pagina)
        {
            case 0:
                if(cant_horarios>3)
                {
                    horarios_por_pagina=3;
                }else
                {
                    horarios_por_pagina=cant_horarios;
                }
                
                for (uint8_t x=0;x<horarios_por_pagina;x++)
                {
                    LCD_I2C_SetCursor(x+2,0);
                    Detallar_Horarios(x+1,9+(5*x),10+(5*x),13+(5*x));
                }
                break;

            case 1:
                
                if(cant_horarios-3>3)
                {
                    horarios_por_pagina=3;
                }else
                {
                    horarios_por_pagina=cant_horarios-3;
                }
                
