ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
                for (uint8_t y=0;y<horarios_por_pagina;y++)
                {
                    LCD_I2C_SetCursor(y+2,0);
                    Detallar_Horarios(y+4,24+(5*y),25+(5*y),28+(5*y));
                }
                break;
        }

        /*----------------------------------------------------------
         * Mostrar controles de navegación
         *----------------------------------------------------------*/
        if (pagina > 0)
        {
            LCD_I2C_SetCursor(2,12);
            LCD_I2C_WriteString("[A]Subir");
        }

        if (pagina < paginas_max)
        {
            LCD_I2C_SetCursor(4,12);
            LCD_I2C_WriteString("[B]Bajar");
        }

        LCD_I2C_SetCursor(3,12);
        LCD_I2C_WriteString("[*]Salir");

        /*----------------------------------------------------------
         * Esperar una tecla del usuario
         *----------------------------------------------------------*/
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        /*----------------------------------------------------------
         * Procesar la tecla presionada
         *----------------------------------------------------------*/
        switch (tecla)
        {
            case 'A':

                Buzzer_ButtonClick(&buzzer1);

                if (pagina > 0)
                    pagina--;

                break;

            case 'B':

                Buzzer_ButtonClick(&buzzer1);

                if (pagina < paginas_max)
                    pagina++;

                break;

            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            default:

                /* Tecla sin función en esta pantalla */
                Buzzer_WarningSound(&buzzer1);
                break;
        }
    }
}
/*
 * ============================================================================
 * FUNCIÓN: SubProceso_ModificarHorario
 * ============================================================================
 * Permite modificar un horario de dispensación previamente registrado.
 *
 * Flujo:
 * 1. Verifica que existan horarios almacenados.
 * 2. Solicita seleccionar el horario a modificar.
 * 3. Solicita la nueva hora en formato 24 horas (HHMM).
 * 4. Solicita el nuevo número de pastillero (1-4).
 * 5. Espera confirmación final del usuario.
 * 6. Actualiza el horario en la EEPROM.
 * 7. Muestra un mensaje de confirmación.
 * ============================================================================
 */
void SubProceso_ModificarHorario(void)
{
    /*
     * Variables locales
     */
    uint8_t horario_selecionado;
    uint8_t pastillero_modificado;
    uint8_t hora_modificada[4] = {};
    
    /*----------------------------------------------------------------------
     * Verificar si existen horarios disponibles para modificar.
     *----------------------------------------------------------------------*/
    if (EEPROM_ReadByte(1) == 0)
    {
        LCD_I2C_Clear();
        LCD_I2C_SetCursor(2,3);
        LCD_I2C_WriteString("No hay Horarios");
        return;
    }
    
    /* Obtener la cantidad de horarios actualmente almacenados */
    dato_memoria = EEPROM_ReadByte(1);
        
    /*----------------------------------------------------------------------
     * Selección del horario a modificar.
     *----------------------------------------------------------------------*/

    /*
        - MODIFICAR HORARIO-
        Horarios activos: 03
        Elegir Horario: [ ]
        [*]Salir
    */
    
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,0);
    LCD_I2C_WriteString("- MODIFICAR HORARIO-");

    LCD_I2C_SetCursor(2,0);
    LCD_I2C_WriteString("Horarios activos: ");
    LCD_I2C_WriteUInt8(dato_memoria,2);

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Elegir Horario: [ ]");
    
    LCD_I2C_SetCursor(4,0);
    LCD_I2C_WriteString("[*]Salir");
    
    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            /* Teclas no permitidas en la selección de horario */
            case 'A':
            case 'B':
            case 'C':
            case 'D':
            case '#':
                
                Buzzer_WarningSound(&buzzer1);
                tecla = KEYPAD_NO_KEY;
                break;

            /* Cancelar operación */
            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            /* Se recibió un número */
            default:
                
                Buzzer_ButtonClick(&buzzer1);

                horario_selecionado = tecla - '0';
                LCD_I2C_SetCursor(3,17);
                LCD_I2C_WriteChar(tecla);
                
                __delay_ms(500);
                
                /* Validar que el horario elegido exista (1 hasta dato_memoria) */
                if(horario_selecionado > dato_memoria || horario_selecionado == 0)
                {
                    Buzzer_WarningSound(&buzzer1);
                    tecla = KEYPAD_NO_KEY;
                }
                else
                {
                    break;
                }
        }

        /* Salir únicamente cuando la selección sea válida */
        if (tecla != KEYPAD_NO_KEY)
            break;
    }
    
    /* Confirmación del horario seleccionado */
    LCD_I2C_SetCursor(4,0);
    LCD_I2C_WriteString("[#]Selec. [*]Salir");
    
    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            case '#':

                Buzzer_ButtonClick(&buzzer1);
                __delay_ms(500);
                break;

            /* Cancelar operación */
            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            /* Cualquier otra tecla es inválida */
            default:

                Buzzer_WarningSound(&buzzer1);
                tecla = KEYPAD_NO_KEY;
        }

        if (tecla != KEYPAD_NO_KEY)
            break;
    }

    /*----------------------------------------------------------------------
     * Modificación de la hora.
     *----------------------------------------------------------------------*/

