ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
    /*
        - EDITAR HORARIO 1 -
        Hora actual:  08:30 
        Nueva hora :  00:00 
                    [*]Salir
    */
    
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,0);
    LCD_I2C_WriteString("- EDITAR HORARIO _ -");
    LCD_I2C_SetCursor(1,17);
    LCD_I2C_WriteUInt8(horario_selecionado,1);
    
    LCD_I2C_SetCursor(2,0);
    LCD_I2C_WriteString("Hora actual:  __:__");
    
    LCD_I2C_SetCursor(2,14);
    dato_memoria = EEPROM_ReadByte(9+(5*(horario_selecionado-1))); // Hora actual
    LCD_I2C_WriteUInt8(dato_memoria,2);
    
    LCD_I2C_SetCursor(2,17);
    dato_memoria = EEPROM_ReadByte(10+(5*(horario_selecionado-1))); // Minutos actuales
    LCD_I2C_WriteUInt8(dato_memoria,2);

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Nueva hora :  xx:xx ");
    
    LCD_I2C_SetCursor(4,12);
    LCD_I2C_WriteString("[*]Salir");
    
    /*
     * Solicitar los cuatro dígitos: HHMM
     */
    for (uint8_t x = 0; x < 4; x++)
    {
        while (1)
        {
            tecla = KEYPAD_NO_KEY;

            while (tecla == KEYPAD_NO_KEY)
            {
                tecla = Keypad_Read(&teclado);
                __delay_ms(20);
            }

            switch (tecla)
            {
                /* Teclas no permitidas */
                case 'A':
                case 'B':
                case 'C':
                case 'D':
                case '#':

                    Buzzer_WarningSound(&buzzer1);
                    tecla = KEYPAD_NO_KEY;
                    break;

                /* Cancelar ingreso */
                case '*':

                    Buzzer_ButtonClick(&buzzer1);
                    return;

                /* Se recibió un número */
                default:

                    Buzzer_ButtonClick(&buzzer1);

                    /* Mostrar el dígito en pantalla */
                    if (x <= 1)
                        LCD_I2C_SetCursor(3, x + 14);
                    else
                        LCD_I2C_SetCursor(3, x + 15);

                    LCD_I2C_WriteChar(tecla);

                    __delay_ms(500);

                    hora_modificada[x] = tecla - '0';

                    /*
                     * Validación del formato HHMM
                     */
                    switch (x)
                    {
                        /* Primer dígito de la hora (0-2) x0:00 */
                        case 0:
                            if (hora_modificada[x] > 2)
                            {
                                Buzzer_WarningSound(&buzzer1);
                                LCD_I2C_SetCursor(3,14);
                                LCD_I2C_WriteString("x");
                                tecla = KEYPAD_NO_KEY;
                            }
                            break;

                        /* Segundo dígito de la hora (0-3) 0x:00 */
                        case 1:
                            if ((hora_modificada[0] == 2) && (hora_modificada[x] > 3))
                            {
                                Buzzer_WarningSound(&buzzer1);
                                LCD_I2C_SetCursor(3,15);
                                LCD_I2C_WriteString("x");
                                tecla = KEYPAD_NO_KEY;
                            }
                            break;

                        /* Decena de minutos (0-5)  00:x00 */
                        case 2:
                            if (hora_modificada[x] > 5)
                            {
                                Buzzer_WarningSound(&buzzer1);
                                LCD_I2C_SetCursor(3,17);
                                LCD_I2C_WriteString("x");
                                tecla = KEYPAD_NO_KEY;
                            }
                            break;
                    }
                    break;
            }

            /* Continuar con el siguiente dígito */
            if (tecla != KEYPAD_NO_KEY)
                break;
        }
    }
    
    /* Confirmación de guardado de hora */
    LCD_I2C_SetCursor(4,0);
    LCD_I2C_WriteString("[#]Guardar [*]Salir");
    
    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            case '#':

                Buzzer_ButtonClick(&buzzer1);
                __delay_ms(500);
                break;

            /* Cancelar operación */
            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            /* Cualquier otra tecla es inválida */
            default:

                Buzzer_WarningSound(&buzzer1);
                tecla = KEYPAD_NO_KEY;
        }

        if (tecla != KEYPAD_NO_KEY)
            break;
    }
    
    /*----------------------------------------------------------------------
     * Modificación del pastillero.
     *----------------------------------------------------------------------*/

    /*
        - EDITAR HORARIO 1 -
        Past. Actual:  P1 
        Nuevo Past. :  Px 
        Past:[1-4] Volver:*
    */
    
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,0);
    LCD_I2C_WriteString("- EDITAR HORARIO _ -");
    LCD_I2C_SetCursor(1,17);
    LCD_I2C_WriteUInt8(horario_selecionado,1);
    
    LCD_I2C_SetCursor(2,0);
    LCD_I2C_WriteString("Past. Actual:  P_");
    LCD_I2C_SetCursor(2,15);
    dato_memoria = EEPROM_ReadByte(13+(5*(horario_selecionado-1))); // Pastillero actual
    LCD_I2C_WriteUInt8(dato_memoria,1);

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Nuevo Past. :  Px");
    
    LCD_I2C_SetCursor(4,0);
    LCD_I2C_WriteString("Past:[1-4] Volver:*");
    
    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            /* Pastilleros válidos */
            case '1':
            case '2':
            case '3':
            case '4':
                pastillero_modificado = tecla - '0';
                LCD_I2C_SetCursor(3,16);
                LCD_I2C_WriteChar(tecla);
                __delay_ms(500);
                break; // <-- BREAK AÑADIDO AQUI
                
            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            /* Cualquier otra tecla es inválida */
            default:

                Buzzer_WarningSound(&buzzer1);
                tecla = KEYPAD_NO_KEY;
        }

        /* Salir únicamente cuando la selección sea válida */
        if (tecla != KEYPAD_NO_KEY)
            break;
    }
    
    /* Confirmación de guardado de pastillero */
    LCD_I2C_SetCursor(4,0);
    LCD_I2C_WriteString("[#]Guardar [*]Salir");
    
    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            case '#':

                Buzzer_ButtonClick(&buzzer1);
                __delay_ms(500);
                break;

            /* Cancelar operación */
            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            /* Cualquier otra tecla es inválida */
            default:

                Buzzer_WarningSound(&buzzer1);
                tecla = KEYPAD_NO_KEY;
        }

        if (tecla != KEYPAD_NO_KEY)
            break;
    }

    /*----------------------------------------------------------------------
     * Guardar datos actualizados en EEPROM.
     *----------------------------------------------------------------------*/
    
    EEPROM_UpdateByte(9+(5*(horario_selecionado-1)), (hora_modificada[0]*10)+hora_modificada[1]);
    EEPROM_UpdateByte(10+(5*(horario_selecionado-1)), (hora_modificada[2]*10)+hora_modificada[3]);
    EEPROM_UpdateByte(13+(5*(horario_selecionado-1)), pastillero_modificado);
    
    /*----------------------------------------------------------------------
     * Mensaje de confirmación final.
     *----------------------------------------------------------------------*/

