ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
                            if ((hora[0] == 2) && (hora[x] > 3))
                            {
                                Buzzer_WarningSound(&buzzer1);

                                LCD_I2C_SetCursor(3,8);
                                LCD_I2C_WriteString("x");

                                tecla = KEYPAD_NO_KEY;
                            }
                            break;

                        /* Decena de minutos (0-5)  00:x00*/
                        case 2:

                            if (hora[x] > 5)
                            {
                                Buzzer_WarningSound(&buzzer1);

                                LCD_I2C_SetCursor(3,10);
                                LCD_I2C_WriteString("x");

                                tecla = KEYPAD_NO_KEY;
                            }
                            break;
                    }

                    break;
            }

            /* Continuar con el siguiente dígito */
            if (tecla != KEYPAD_NO_KEY)
                break;
        }
    }

    /*----------------------------------------------------------------------
     * Confirmación de guardado.
     *----------------------------------------------------------------------*/

    LCD_I2C_SetCursor(4,0);
    LCD_I2C_WriteString("[#]Guardar: [*]Salir");

    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            case '#':

                Buzzer_ButtonClick(&buzzer1);
                break;

            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            default:

                Buzzer_WarningSound(&buzzer1);
                tecla = KEYPAD_NO_KEY;
        }

        if (tecla != KEYPAD_NO_KEY)
            break;
    }

    /*----------------------------------------------------------------------
     * Guardar el nuevo horario en EEPROM.
     *----------------------------------------------------------------------*/

    EEPROM_UpdateByte(9 + (index_horarios_ocupados * 5),
                      (hora[0] * 10) + hora[1]);

    EEPROM_UpdateByte(10 + (index_horarios_ocupados * 5),
                      (hora[2] * 10) + hora[3]);

    EEPROM_UpdateByte(13 + (index_horarios_ocupados * 5),
                      pastillero_selecionado);

    /* Actualizar cantidad de horarios almacenados */
    EEPROM_UpdateByte(1, index_horarios_ocupados + 1);

    /*----------------------------------------------------------------------
     * Mensaje de confirmación.
     *----------------------------------------------------------------------*/

    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,0);
    LCD_I2C_WriteString("--------------------");

    LCD_I2C_SetCursor(2,2);
    LCD_I2C_WriteString("HORARIO GUARDADO");

    LCD_I2C_SetCursor(3,3);
    LCD_I2C_WriteString("P");

    LCD_I2C_WriteUInt8(pastillero_selecionado,1);
    LCD_I2C_WriteString(" a las ");

    dato_memoria = EEPROM_ReadByte(9 + (index_horarios_ocupados * 5));
    LCD_I2C_WriteUInt8(dato_memoria,2);

    LCD_I2C_WriteString(":");

    dato_memoria = EEPROM_ReadByte(10 + (index_horarios_ocupados * 5));
    LCD_I2C_WriteUInt8(dato_memoria,2);

    LCD_I2C_SetCursor(4,0);
    LCD_I2C_WriteString("--------------------");

    __delay_ms(2000);
}
/******************************************************************************
 * Función: SubProceso_RegistrarPastillas
 *----------------------------------------------------------------------------
 * Permite registrar una recarga de pastillas en uno de los cuatro
 * compartimientos disponibles.
 *
 * Flujo:
 *   1. Lee el stock total almacenado en EEPROM.
 *   2. Verifica que los datos sean válidos.
 *   3. Muestra el stock actual de cada pastillero.
 *   4. Permite seleccionar el compartimiento (1-4).
 *   5. Solicita la cantidad de pastillas a agregar.
 *   6. Guarda la nueva información al confirmar con '#'.
 *
 * Controles:
 *   1-4 -> Seleccionar pastillero.
 *   0-9 -> Cantidad a agregar.
 *   #   -> Guardar cambios.
 *   *   -> Cancelar operación.
 ******************************************************************************/
void SubProceso_RegistrarPastillas(void)
{
    uint8_t pastillero_selecionado;
    uint8_t cantidad_a_sumar = 0;

    /*==============================================================
     * Leer stock total de pastillas
     *==============================================================*/
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,1);
    LCD_I2C_WriteString("REG. CANT. PASTILLAS");

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Leyendo Memoria");

    dato_memoria = EEPROM_ReadByte(2);

    MostrarAnimacionCarga(4,0);

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Extrayendo Datos");

    MostrarAnimacionCarga(4,4);

    /*==============================================================
     * Validar datos leídos
     *==============================================================*/
    if (dato_memoria == 0xFF)
    {
        MostrarAnimacionCarga(4,8);

        LCD_I2C_SetCursor(3,0);
        LCD_I2C_ClearFile();

        LCD_I2C_SetCursor(3,2);
        LCD_I2C_WriteString("Datos Corruptos");

        __delay_ms(1500);
        return;
    }

    /*==============================================================
     * Mostrar stock total disponible
     *==============================================================*/
    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Pastillas disp: ");
    LCD_I2C_WriteUInt8(dato_memoria,2);

    MostrarAnimacionCarga(4,8);

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Preparando sistema..");

    MostrarAnimacionCarga(4,12);

    /*==============================================================
     * Mostrar stock individual de cada pastillero
     *==============================================================*/
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,0);
    LCD_I2C_WriteString(" STOCK PASTILLEROS ");

    LCD_I2C_SetCursor(2,0);
    LCD_I2C_WriteString("P1:[");
    dato_memoria = EEPROM_ReadByte(10);
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString("]      P2:[");

